/* 
  Localizable.strings
  Tyme3

  Created by Lars Gerckens on 03.11.21.
  Copyright © 2021 Lars Gerckens. All rights reserved.
*/

/*
 Changelog:

 4.9
ALL triggers are now automatically checked & called AFTER your Mac wakes up AND is unlocked.
Which means, that Shortery can now detect changed devices, monitors, wifi, battery state, etc. when waking up.

- Crash bugfix for the device connected action

 4.8
 Besides triggers, Shortery now offers a few new actions for the Shortcuts app:
 - Check if an app is running
 - Check if the dark mode is active
 - Check if your webcam is on

 4.7

 - NEW global option to prevent your Mac from sleeping. Can be useful, to make sure all time triggers are run
 - NEW option for the calendar trigger to pass in the title of the current calendar event
 - NEW option for the app trigger: Pass in the ID of the current app

*/

/*

Screenshot Size:
-----------------------------------------------------------------
1280x800 1440x900 2560x1600 2880x1800

Subtitle:
Automation for Shortcuts
 
Shortery Keywords:
-----------------------------------------------------------------
shortcuts, automate, automation, hotkeys, trigger, launch, run

Shortery App Store Description:
-----------------------------------------------------------------
Run your Shortcuts automatically with Shortery.

Tired of manually executing a Shortcut every morning when starting to work?
Just add the Shortcut to Shortery and let it run automatically.

Shortery offers several different triggers to run a Shortcut:

* Application
Run a shortcut when you start or quit an app or when the app becomes active / inactive.

* Devices
Run a shortcut when you connect or disconnect any USB, Bluetooth device or your headphones.

* Camera
Run shortcuts when your webcam is switched on or off.

* Folders
Observe any folder on your Mac and run a shortcut, when the contents change.

* Focus Mode
Trigger a shortcut when a focus mode on your Mac changes.

* Monitors
Trigger a shortcut, when you connect or disconnect a monitor.

* WiFi
Run a shortcut when your WiFi connection changes.

* Time
Set a time when the Shortcut should run and define how often it should be repeated.

* Wake Up & Sleep
Run Shortcuts before your Mac goes to sleep or after it wakes up.

* Login & Logout
How about your Mac greeting you in the morning and telling you about your current day? Use the Login-Trigger to get your day started.

* Keyboard
Need direct access to a Shortcut? Define a global hotkey and trigger it from any app.

* Appearance
Run a Shortcut when your Mac changes from dark to light mode or light to dark mode.

* Power
Run a Shortcut when you plug in a power adapter or your battery capacity runs low.

* Screen
Triggers a Shortcut, when you lock or unlock your screen.

 * Sunrise & Sunset
Run Shortcuts when the sun sets or rises based on your current location.

 * Calendar Events
Run a Shortcut when a meeting starts or ends.
 
 */

/*

 Run any Shortcut from the Shortcuts app automatically.
 When you start an application, connect USB, Bluetooth devices or a monitor, when your WiFi connection changes, you log in or log out, your Mac looses power and many more…

 */

"AppTitle" = "Shortery";
"AppSubTitle" = "捷径自动化";
"AppSearchFieldSearch" = "搜索…";

"AppVersionInformation" = "Mac上的捷径自动化工具. Version %@";

"MenuBarTitle" = "Shortery";
"MenuBarShow" = "显示Shortery";
"MenuBarTriggers" = "%@个活跃的触发器";
"MenuBarLastRun" = "%@, %@";
"MenuBarQuit" = "退出Shortery";

"ToolbarItemTrigger" = "触发器";
"ToolbarItemPreferences" = "偏好设置";
"ToolbarItemAbout" = "关于";

"IntroText" = "通过自动运行充分发挥您的捷径的全部功能。只需添加一个新的触发器，选择您的捷径，并选择其运行方式。请注意，Shortery 和您的 Mac 必须运行且保持唤醒状态，以便代表您执行捷径。";

"NoShortcutsFound" = "未找到捷径。您要么在 捷径应用 中没有任何捷径，要么您拒绝了 Shortery 对捷径的访问。请在以下位置检查状态：设置 > 安全与隐私 > 自动化 > Shortery > 捷径与捷径事件。";

"ShortcutsFolderBug" = "如果您在此列表中缺少整个捷径文件夹：请重新启动您的 Mac。不幸的是，这仍然是捷径应用和最新 macOS 的问题。";

"NoTriggersHint" = "未配置捷径触发器。要添加您的第一个触发器，请点击 ⊕ 添加捷径触发器按钮。";

"ButtonAddShortcut" = "添加捷径触发器";

"LastRunNever" = "上次运行：从未";
"LastRunDate" = "上次运行：%@";

"PreferencesContactInfo" = "感谢您使用Shortery。如果您有任何问题或希望添加功能，请告诉我们。\n\n对其他生产力应用感兴趣吗？看看 Tyme —— 一个简单而有效的时间跟踪应用。\n\n© 2023 – 2024 Unit Numberfive oHG - 保留所有权利\n\n汉化by - mengnimen";

"PreferencesStartAtLogin" = "登录时启动";
"PreferencesStartAtLoginHint" = "如果您想使用登录触发器，需要启用此功能。";

"PreferencesShowMenuBar" = "显示菜单栏图标";
"PreferencesShowMenuBarHint" = "当您禁用菜单栏图标时，您可以只通过查找器 > 应用程序 > Shortery 来显示 Shortery。";

"PreferencesPreventSleep" = "防止休眠";
"PreferencesPreventSleepHint" = "当您的Mac处于睡眠状态时，Shortery无法运行捷径。启用此选项后，Shortery将防止您的Mac 休眠，以便所有捷径都能在正确的时间执行。但是请注意，合上屏幕、苹果菜单、电池电量低或其他原因，macOS仍可能会休眠。";

"PreferencesCheckUpdates" = "检查更新";

"PreferencesEnableLogging" = "启用调试日志";
"PreferencesOpenLogFolder" = "打开日志文件夹";

"PreferencesOpenDatabase" = "打开数据库和日志文件夹";

"cancelButtonTitle" = "取消";
"okButtonTitle" = "保存";

"NewShortcutTitle" = "配置捷径触发器";

"TypeTimeHint" = "此触发器基于时间运行捷径。选择定时器应如何重复。";
"TypeLoginHint" = "此触发器在您登录、注销/关闭 Mac 时运行捷径。";
"TypeHotkeyHint" = "此触发器通过全局键盘快捷键运行捷径。您可以从 Mac 上的任何应用程序激活它。";
"TypeAppHint" = "此触发器在应用启动或退出时运行捷径。";
"TypeWorkspaceHint" = "此触发器在您的 Mac 睡眠或唤醒时运行捷径。";
"TypeAppearanceHint" = "此触发器在外观从深色模式变为浅色模式或从浅色模式变为深色模式时运行捷径。";
"TypePowerStatusHint" = "此触发器在您插入电源适配器或电池电量变化时运行捷径。Shortery 每分钟检查一次电池状态。";
"TypeFocusModeHint" = "此触发器在您的 Mac 焦点模式变化时运行捷径。请注意，您必须在系统设置 > 焦点 > 焦点状态 > 开启中共享焦点状态。";
"TypeScreenLockHint" = "此触发器在您锁定或解锁屏幕时运行捷径。";
"TypeDeviceConnectionHint" = "此触发器在您连接或断开蓝牙、USB 设备或耳机时运行捷径。";
"TypeMonitorHint" = "此触发器在您连接或断开显示器时运行捷径。";
"TypeWiFiHint" = "此触发器在您连接或断开特定 WiFi 时运行捷径。";
"TypeSunHint" = "此触发器根据您的当前位置在日出或日落时运行捷径。";
"TypeFolderHint" = "此触发器在文件夹内容变化时运行捷径（文件添加、重命名或删除）。";
"TypeCalendarHint" = "此触发器可以为日历事件运行捷径。它将在事件开始和结束时触发捷径，并将字符串开始或结束传递给捷径。";
"TypeCameraHint" = "此触发器在您的网络摄像头开启或关闭时运行捷径。";

"ShortcutEnabled" = "启用触发器";
"ShortcutRunLocked" = "在 Mac 锁定时运行";
"ShortcutRunLockedHint" = "如果触发器不应在您的 Mac 锁定时运行，Shortery 将延迟触发器，直到您的 Mac 解锁。";

"ShortcutType" = "触发器类型";
"ShortcutTypeApp" = "应用程序";
"ShortcutTypeTime" = "时间";
"ShortcutTypeWorkspace" = "唤醒和睡眠";
"ShortcutTypeLogin" = "登录和注销";
"ShortcutTypeHotkey" = "键盘";
"ShortcutTypeAppearance" = "外观";
"ShortcutTypePower" = "电源状态";
"ShortcutTypeFocus" = "焦点模式";
"ShortcutTypeScreenLock" = "屏幕锁定和解锁";
"ShortcutTypeDeviceConnection" = "设备";
"ShortcutTypeMonitor" = "显示器";
"ShortcutTypeWiFi" = "WiFi";
"ShortcutTypeSun" = "日出和日落";
"ShortcutTypeFolder" = "文件夹内容";
"ShortcutTypeCalendar" = "日历事件";
"ShortcutTypeCamera" = "摄像头";

"ShortcutSelect" = "选择捷径";
"ShortcutLoading" = "加载中…";
"ShortcutSelectPlease" = "请选择…";
"ShortcutName" = "名称";
"ShortcutNamePlaceholder" = "名称";

"ShortcutReloadList" = "重新加载捷径列表";

"ShortcutInputHintLabel" = "输入字符串";
"ShortcutInputHintText" = "%@ 在触发时发送给捷径。";

"ShortcutTime" = "在";
"ShortcutTimeRepeat" = "重复";
"ShortcutTimeRepeatMinute" = "每 %i 分钟";
"ShortcutTimeRepeatHour" = "每 %i 小时";
"ShortcutTimeRepeatDay" = "每天";
"ShortcutTimeRepeatWeek" = "每周";
"ShortcutTimeRepeatMultiplier" = "倍增器";
"ShortcutTimeWeekdays" = "工作日";
"ShortcutTimeFireIfMissed" = "不跳过";
"ShortcutTimeFireIfMissedHint" = "如果 Shortery 无法在准确时间触发（Mac 睡眠等），则稍后触发定时器（Mac 唤醒等）。";
"ShortcutTimeNextTimers" = "预定的触发器";
"ShortcutTimeFromDate" = "从";
"ShortcutTimeToDate" = "到";

"ShortcutAppUseBundleID" = "使用应用的包 ID 与事件名称作为捷径的输入。用换行符分隔。";
"ShortcutAppSelect" = "应用程序";
"ShortcutAppSelectHint" = "必须已经运行应用程序才能选择它。";
"ShortcutAppEvent" = "应用状态";
"ShortcutAppEventStarted" = "已启动";
"ShortcutAppEventQuit" = "已退出";
"ShortcutAppEventActive" = "已激活";
"ShortcutAppEventInactive" = "已停用";

"ShortcutEventLoginLabel" = "触发于";
"ShortcutEventLogin" = "登录";
"ShortcutEventLogout" = "注销";
"ShortcutEventLogoutHint" = "请注意，您可能无法在注销期间启动其他应用程序或进程。小而快的事情应该可以工作。macOS 试图在注销期间终止一切。";

"ShortcutWorkspaceEvent" = "Mac";
"ShortcutWorkspaceEventWake" = "唤醒";
"ShortcutWorkspaceEventSleep" = "睡眠";

"ShortcutHotkey" = "键盘快捷键";
"ShortcutHotkeyPlaceholder" = "点击记录…";

"ShortcutAppearanceEvent" = "当设置为";
"ShortcutAppearanceEventLightMode" = "浅色模式";
"ShortcutAppearanceEventDarkMode" = "深色模式";

"ShortcutPowerStatusEvent" = "事件";
"ShortcutPowerStatusEventACConnected" = "交流电已连接";
"ShortcutPowerStatusEventACDisconnected" = "交流电已断开";
"ShortcutPowerStatusEventBatteryAbove" = "电池电量高于";
"ShortcutPowerStatusEventBatteryBelow" = "电池电量低于";

"ShortcutPowerStatusBatteryPercentage" = "电池百分比";

"ShortcutFocusChangeType" = "模式";
"ShortcutFocusChangeTypeAny" = "任何焦点";
"ShortcutFocusChangeTypeSpecific" = "特定焦点激活";
"ShortcutFocusModeSelection" = "是";
"ShortcutFocusModeEnabled" = "激活";
"ShortcutFocusModeDisabled" = "停用";
"ShortcutFocusModeSpecificHint" = "如果您的 Mac 的焦点状态发生变化（开启/关闭任何焦点或特定焦点激活），您可以触发捷径。\n\n请确保系统设置 > 焦点 > 焦点状态已开启\n\n如果您想触发特定焦点模式：\n\n选择上面的特定焦点并在您的 Mac 焦点设置中选择触发器：\n\n- 系统设置 > 焦点\n- 选择一个焦点（如 睡眠）\n- 焦点过滤器 > 添加过滤器…\n- 选择 Shortery\n- 选择触发器\n- 完成。\n\n任何焦点变化都会每30秒检查一次。特定的焦点变化是即时的。";
"ShortcutFocusModeUnAuthorized" = "Shortery 无法访问焦点模式。请在系统设置 > 安全与隐私 > 焦点 > Shortery下启用它。";

"ShortcutScreenLockSelection" = "屏幕状态";
"ShortcutScreenLocked" = "已锁定";
"ShortcutScreenUnlocked" = "已解锁";

"ShortcutSelectedDevice" = "已选择的设备";
"ShortcutDeviceConnectionEvent" = "事件";
"ShortcutDevicesConnected" = "连接";
"ShortcutDevicesDisconnected" = "断开";
"ShortcutDevicesNoName" = "未知设备";

"ShortcutMonitorListLabel" = "显示器";
"ShortcutMonitorEvent" = "事件";
"ShortcutMonitorConnect" = "连接";
"ShortcutMonitorDisconnect" = "断开";

"ShortcutWiFiName" = "WiFi SSID";
"ShortcutWiFiSSIDEmpty" = "未连接任何 WiFi。";
"ShortcutWiFiSSIDHint" = "要为任何 WiFi 触发捷径，请输入 * 作为 SSID。";
"ShortcutWiFiEvent" = "事件";
"ShortcutWiFiConnect" = "连接";
"ShortcutWiFiDisconnect" = "断开";

"ShortcutSunStateLabel" = "事件";
"ShortcutSunStateOffset" = "偏移";
"ShortcutSunStateDate" = "触发时间";
"ShortcutSunStateSunRise" = "日出";
"ShortcutSunStateSunSet" = "日落";
"ShortcutSunStateNoLocationServices" = "Shortery 的位置服务已禁用。请在系统偏好设置 > 安全与隐私 > 位置服务 > Shortery中启用它们。";

"ShortcutFolderChooseButton" = "选择文件夹…";
"ShortcutFolderEmptyHint" = "请选择您想要观察的文件夹。";
"ShortcutFolderTriggerSizeChange" = "文件大小变化也会触发";

"ShortcutCalendarTitle" = "标题包含";
"ShortcutCalendarTitlePrompt" = "留空则为日历中的所有事件";
"ShortcutCalendarUseTitle" = "使用日历事件标题和事件名称作为捷径的输入。用换行符分隔。";
"ShortcutCalendarID" = "日历";
"ShortcutCalendarStartOffset" = "开始偏移";
"ShortcutCalendarEndOffset" = "结束偏移";
"ShortcutCalendarUnavailable" = "请启用：隐私与安全 > 日历 > Shortery";

"ShortcutCameraEventLabel" = "摄像头转换";
"ShortcutCameraEventOn" = "开启";
"ShortcutCameraEventOff" = "关闭";
"ShortcutCameraAuthHint" = "Shortery 无法访问您的摄像头。请在系统设置 > 安全与隐私 > 相机 > Shortery下启用它。";

// Purchases

"ShorteryHasProPurchaseLabel" = "感谢您的购买. 所有 ![](ProIcon) 功能已解锁";
"ShorteryHasNothingPurchasedLabel" = "您正在使用免费版本. 立即解锁 ![](ProIcon) 功能.\n\n已购买? [Restore your purchase](/restore_purchase).";
"ShorteryPurchaseProButton" = "Purchase ![](ProIcon) for %@ / Year";
"ShorteryPurchaseProTrialButton" = "Try ![](ProIcon) for 7 days. Then %@ / Year";
"ShorteryPurchasedProButton" = "![](ProIcon) 版本已解锁";

"ShorteryProHintMessage" = "需要 Shortery Pro";
"ShorteryProHintInfo" = "要激活此触发器，您需要Shortery Pro。您可以直接从触发器表单购买。一旦购买，您可以使用所有专业触发器。";
"ShorteryProHintOk" = "关闭";
"ShorteryProductErrorLabel" = "无法加载PRO版本。请从 App Store 重新安装 Shortery。";
"ShorteryProductErrorButton" = "PRO版本购买错误";
